Repository: aceauses/ft_transcendence
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: de, sv

source: Opponent username is required.
de: Nutzername des Gegners wird benötigt.
sv: Motståndarens användarnamn är obligatoriskt.

source: You cannot play against yourself.
de: Du kannst nicht dich selbst befreunden!
sv: Du kan inte spela mot dig själv.

source: Opponent does not exist.
de: Gegner existiert nicht!
sv: Motståndaren existerar inte.

source: User does not exist.
de: Dieser Nutzer existiert nicht!
sv: Användaren finns inte.

source: Game created successfully.
de: Spiel erfolgreich erstellt.

source: game_id score1 and score2 are required
de: Game ID, Score 1 und Score 2 müssen eingegeben werden
sv: game_id score1 och score2 är obligatoriska

source: Game not found.
de: Spiel wurde nicht gefunden.
sv: Spelet hittades inte.

source: Game successfully saved score.
de: Spielstand erfolgreich gespeichert.
sv: Spelet har framgångsrikt sparat poäng.

source: game_id, control1, and control2 are required.
de: Game ID, Controler 1 und Controler 2 müssen eingegeben werden.
sv: game_id, control1 och control2 är obligatoriska.

source: You are not a player in this game.
de: Du bist kein Mitspieler in diesem Spiel.
sv: Du är inte en spelare i det här spelet.

source: Control settings successfully updated for user
de: Präferenzen für Eingabe erfolgreich aktualisiert

source: user does not exist.
de: Dieser Nutzer existiert nicht!
sv: Användaren finns inte.

source: Tournament created successfully.
de: Tournier erfolgreich erstellt.

source: Games created successfully
de: Spiele erfolgreich erstellt

source: No Games Found
de: Keine Spiele gefunden.

source: Home
de: Startseite
sv: Hem

source: Dashboard
de: Benutzerübersicht
sv: Översikt

source: English
de: Englisch
sv: Engelska

source: Swedish
de: Schwedisch
sv: Svenska

source: German
de: Deutsch
sv: Tyska

source: 2FA required. Please enter your code.
de: 2FA benötigt. Bitte gib deinen code ein.
sv: 2FA krävs. Vänligen ange din kod.

source: Login successful.
de: Anmeldung war erfolgreich.
sv: Inloggningen lyckades.

source: You cannot befriend yourself!
de: Du kannst nicht dich selbst befreunden!
sv: Du kan inte bli vän med dig själv!

source: Friend request pending approval.
de: Es ist bereits eine Freundschaftsanfrage im gange.
sv: Vänförfrågan väntar på godkännande.

source: You are already friends!
de: Ihr seid schon befreundet!
sv: Ni är redan vänner!

source: you did not send the friend request, you can only deny it!
de: Du hast die Freundschaftsanfrage nicht gestellt, du kannst sie nur ablehnen!
sv: du skickade inte vänförfrågan, du kan bara neka till den!

source: There is no request to deny
de: Es gibt keine Freundschaftsanfrage an dich.
sv: Det finns ingen begäran om att neka

source: you sent the friend request, you can only cancel it!
de: Du hast die Freundschaftsanfrage gestellt und kannst sie nur abbrechen!
sv: du skickade vänförfrågan, kan du bara avbryta den!

source: the request you are trying to accept does not exist
de: Die anzunehmende Freundschaftsanfrage existiert nicht.
sv: den begäran du försöker acceptera finns inte

source: the friendship you are trying to delete does not exist
de: Es gibt keine Freundschaft zwischen euch!
sv: den vänskap du försöker ta bort finns inte

source: The target user does not exist!
de: Dieser Nutzer existiert nicht!
sv: Målanvändaren finns inte

source: Friend request sent successfully.
de: Freundschaftsanfrage gesendet.

source: Friend request cancelled.
de: Freundschaftsanfrage abgebrochen.
sv: Vänförfrågan avbruten.

source: Friend request accepted.
de: Freundschaftsanfrage akzeptiert.

source: Friend request denied.
de: Freundschaftsanfrage abgelehnt.

source: Friendship ended.
de: Freundschaft beendet.
sv: Vänskapen upphörde.

source: User blocked successfully.
de: Benutzer wurde erfolgreich blockiert.
sv: Användaren blockerades framgångsrikt.

source: Invalid request method.
de: Ungültige Anforderungsmethode.
sv: Ogiltig metod för begäran.

source: User unblocked successfully.
de: Benutzer ist nun nicht mehr blockiert.

source: Passwords do not match.
de: Passwörter stimmen nicht überein.
sv: Lösenorden stämmer inte överens.

source: Account created successfully.
de: Benutzerkonto wurde erfolgreich erstellt.
sv: Konto har skapats framgångsrikt.

source: Invalid username or password!
de: Ungülter Benutzername or Passwort!
sv: Ogiltigt användarnamn eller lösenord!

source: Logout successful.
de: Abmeldung war erfolgreich.
sv: Utloggningen lyckades.

source: Invalid password.
de: Ungültiges Passwort.
sv: Ogiltigt lösenord.

source: Profile updated successfully.
de: Profil erfolgreich aktualisiert.
sv: Profilen uppdaterades framgångsrikt.

source: Invalid email address.
de: Ungültige E-Mail Addresse
sv: Ogiltig e-postadress.

source: An Account with this email already exists.
de: Ein Benutzerkonto mit dieser E-Mail existiert bereits.
sv: Ett konto med den här e-postadressen finns redan.

source: Invalid username. Username must contain only letters, numbers, and underscores, and cannot be empty or contain only whitespace.
de: Ungültiger Benutzername. Der Benutzername darf nur Buchstaben, Zahlen und Unterstriche enthalten und darf nicht leer sein oder nur Leerzeichen enthalten.
sv: Ogiltigt användarnamn. Användarnamnet får endast innehålla bokstäver, siffror och understreck och får inte vara tomt eller innehålla enbart blanksteg.

source: Username already taken.
de: Benutzername schon vergeben.
sv: Användarnamn redan taget.

source: Invalid current password.
de: Ungültiges aktuelles Passwort.
sv: Ogiltigt aktuellt lösenord.

source: 2FA verification required
de: 2FA Verifizierung erforderlich
sv: 2FA-verifiering krävs

source: Invalid or expired request
de: Ungültige Anforderungsmethode.

source: Invalid 2FA code
de: 2FA code ungültig

source: Password changed successfully.
de: Passwort wurde erfolgreich geändert.
sv: Lösenordet har ändrats framgångsrikt.

source: Quiz
sv: Frågesport

source: You have blocked this user, you cannot send a friend request.
sv: Du har blockerat den här användaren, du kan inte skicka en vänförfrågan.

source: This user has blocked you, you cannot send a friend request.
sv: Den här användaren har blockerat dig, du kan inte skicka en vänförfrågan.
