Repository: aceauses/ft_transcendence
Catalog: pongus_magnificus/locale/*/LC_MESSAGES/djangojs.po
Languages: de

source: Refresh
de: Aktualisieren

source: 's profile picture
de: s Profilbild

source: Blocked Users
de: Geblockte Nutzer

source: Friends
de: Freunde

source: Friend Requests
de: Freundschaftsanfragen

source: Quiz Stats
de: Quiz-Statistiken

source: Pong Stats
de: Pong-Statistiken

source: Last Pong Games
de: Letzte Pong Spiele.

source: Error loading profile for
de: Fehler beim Laden des Profils von

source: 's Profile
de: s Profil

source: Unblock
de: Entblocken

source: Block
de: Blockieren

source: Games Played:
de: Gespielte Partien:

source: Games Won:
de: Gewonnene Partien:

source: Total Score:
de: Gesamtpunktzahl:

source: High Score:
de: Höchste Punktzahl:

source: Questions Asked:
de: Gestellte Fragen:

source: Correct Answers:
de: Richtige Antworten:

source: Games Lost:
de: Verlorene Partien:

source: Win-Loss Ratio:
de: Sieg-Niederlagen Verhältnis

source: This user has blocked you. You cannot view their profile.
de: Dieser Nutzer hat dich geblockt. Du kannst ihr Profil nicht ansehen.

source: Settings
de: Einstellungen

source: Add Friend
de: Freund hinzufügen

source: Remove Friend
de: Freund entfernen

source: Cancel Request
de: Freundschaftsanfrage abbrechen

source: Accept Request
de: Freundschaftsanfrage annehmen

source: Are you sure you want to remove this friend?
de: Willst du diesen Freund wirklich entfernen?

source: Are you sure you want to cancel this friend request?
de: Willst du diese Freundschaftsanfrage abbrechen?

source: No blocked users
de: Keine geblockten Nutzer

source: Friend
de: Freund

source: No friends
de: Keine Freunde

source: Fetching friends failed
de: Beziehen der Freundschaften fehlgeschlagen

source: Received Friend Requests:
de: erhaltene Freundschaftsanfragen

source: No friend requests
de: Keine Freundschaftsanfragen

source: Accept
de: Annehmen

source: Deny
de: Ablehnen

source: Sent Friend Requests:
de: gesendete Freundschaftsanfragen

source: No sent friend requests
de: Keine gesendeten Freundschaftsanfragen

source: Remove
de: entfernen

source: No recent games.
de: Keine abgeschlossenen Spiele.

source: pending Tournament game
de: ausstehendes Spiel im Tournier

source: pending
de: ausstehend

source: Practice Game
de: Übungspiel starten

source: New Tournament
de: Neues Tournier

source: Play Game
de: Spiel Spielen

source: Enter opponent Username
de: Nutzername des Gegners eingeben

source: Recent Games
de: Letzte Spiele

source: No games have been played yet.
de: Bisher wurden keine Spiele gespielt.

source: Pending Games
de: Ausstehende Spiele.

source: No pending games.
de: Kein ausstehendes Spiel.

source: Open Tournaments
de: Offene Tourniere

source: Join Open Tournament
de: Offenem Tournier beitreten

source: No open tournaments.
de: Keine offenen Tourniere

source: Error, enter a valid Username!!
de: Fehler, gib einen gueltigen Nutzername ein

source: Error, enter a Username!!
de: Fehler, Nutzername des Gegners eingeben

source: Ready
de: Bereit

source: Left Paddels: W S; Right Paddels: UP DOWN;
de: Linke Paddel: W S; Rechte Paddel: HOCH RUNTER

source: Start Game
de: Spiel starten

source: player
de: Spieler

source: Pause Game
de: Spiel pausieren

source: Welcome to Tournament
de: Willkommen zum Tournier

source: Play Tournament Games +
de: Spiel im Tournier spielen +

source: Start Final Game
de: Finale starten

source: Go to Menu
de: zurück zum Menü

source: points
de: Punkte

source: Welcome to
de: Willkommen in

source: You have successfully joined the room!
de: Du bist dem Raum beigetreten!

source: Here you can start participating in the quiz.
de: Hier kannst du am Quiz teilnehmen. (Die Fragen im Quiz sind auf Englisch!)

source: Leave Room
de: Raum verlassen

source: Participants:
de: Mitspieler:

source: Quiz in Progress
de: Quiz läuft

source: The quiz has started! Good luck!
de: Das Quiz is gestartet! Viel Glück!

source: The quiz has ended!
de: Das Quiz ist beendet!

source: Create a new room
de: Erstelle einen neuen Raum

source: Create Room
de: Raum erstellen

source: Room Name
de: Raumname

source: Enter room name
de: Gib den Raumnamen ein

source: Submit
de: Erstellen

source: Gratefully using OpenTD
de: Das Quiz benutzt OpenTD

source: An error occurred:
de: Ein Fehler ist aufgetreten:

source: Loading rooms...
de: Räume werden geladen...

source: Error loading rooms. Please try again later.
de: Fehler beim laden der Räume. Versuche es später nocheinmal

source: No rooms available. Create a new room to get started.
de: Keine Räume verfügbar. Erstelle einen neuen Raum um ein Quiz zu starten.

source: Last activity:
de: Letzte Aktivität:

source: Join
de: Beitreten

source: Available Rooms
de: Verfügbare Räume

source: Welcome to the Transcendence Webpage
de: Willkommen auf unserer Transcendence-Webseite

source: This is a webpage created for the Transcendence project.
de: WebSeite für das Transcendence-Projekt

source: Features:
de: Funktionen:

source: points. (Minor Module = 1 point, Major Module = 2 points!)
de: Punkte. (Kleines Modul = 1 Punkt, Hauptmodul = 2 Punkte!)

source: 14 points are sufficient for the basic requirements with 19 giving 125%!
de: 14 Punkte reichen für die Grundanforderungen aus, 19 Punkte ergeben 125%!

source: Minimal Requirements (no points, all need to be fullfilled):
de: Minimale Anforderungen (keine Punkte, alle müssen erfüllt sein):

source: This project is part of the core curriculum of 42 and serves as its final project.
de: Das Projekt ist ein Teil des Grundstudienplans der 42 und ist das finale Projekt.

source: This is our take on it.
de: Das ist unsere Version.

source: Our Projects GitHub Repository
de: Das GitHub Repository unseres Projektes

source: The team:
de: Teammitglieder

source: Ressources used:
de: genutzte Ressourcen

source: Libraries used:
de: genutzte Bibliotheken:

source: Account
de: Benutzerkonto

source: Logout
de: Abmelden

source: Login
de: Anmelden

source: Register
de: Registrieren

source: Page not found!
de: Seite konnte nicht gefunden werden!

source: Please ensure the current URL is correct.
de: Bitte stelle sicher, dass die aktuelle URL korrekt ist.

source: Your Profile Picture
de: Dein Profilbild

source: Profile Info:
de: Profil Infos:

source: Username:
de: Benutzername:

source: Update Profile Data
de: Profildaten aktualisieren

source: Enter your password
de: Bitte gib dein Passwort ein

source: Change Password
de: Passwort ändern

source: Current Password
de: Aktuelles Passwort

source: New Password
de: Neues Passwort

source: Repeat New Password
de: Neues Passwort wiederholen

source: Save
de: Speichern

source: Two-Factor Authentication Required
de: Zwei-Faktor Authentifizierung erforderlich

source: Please enter your 2FA code to complete this security-sensitive operation:
de: Bitte 2FA code eingeben um diese sicherheitsrelevante Aktion durchzuführen:

source: Enter 2FA Code
de: 2FA Code eingeben

source: Verify
de: Verifizieren

source: Two-Factor Authentication (2FA):
de: Zwei-Faktor Authentifizierung (2FA):

source: Disabled
de: Deaktiviert

source: Enable 2FA
de: 2FA aktivieren

source: Enter your 2FA code to disable:
de: zur Deaktivierung 2FA code eingeben:

source: Confirm Disable
de: Deaktivierung bestätigen

source: Scan the QR code below with your authenticator app:
de: Scanne den QR code mit deiner Authentifizierungs-app:

source: Or enter this code manually:
de: Oder gib den code manuell ein:

source: Enter the code from your authenticator app to enable 2FA:
de: Gib den code von deiner Authentifizierungs-app ein, um 2FA einzurichten:

source: Confirm
de: Bestätigen

source: Failed to load account details
de: Fehler beim laden der Kontodetails

source: Enabled
de: Aktiviert

source: Disable 2FA
de: 2FA deaktivieren

source: Password is required
de: Passwort ist notwendig

source: Please enter a valid 6-digit code
de: Bitte gib einen gültigen 6-stelligen code ein

source: Failed to verify and update password
de: Fehler beim validieren und Passwort aktualisieren

source: Please select an image file
de: Bitte wähle eine Bilddatei aus

source: Failed to start 2FA setup
de: Fehler beim starten der 2FA Einrichtung

source: No changes detected
de: Keine Änderungen gefunden

source: Failed to confirm 2FA setup
de: Fehler beim bestätigen der 2FA Einrichtung

source: Failed to disable 2FA
de: Fehler beim deaktivieren von 2FA

source: Password:
de: Passwort:

source: Sign In
de: Anmelden

source: OAuth2 using 42
de: OAuth mit 42

source: Want to create an Account?
de: Willst du ein Benutzerkonto erstellen?

source: Two-Factor Authentication
de: Zwei-Faktor Authentifizierung

source: Please enter your 2FA code:
de: Bitte gib deinen 2FA code ein:

source: 6-digit code
de: 6-stelliger code

source: Username is required
de: Benutzername ist notwendig

source: Invalid 2FA code
de: Ungültiger 2FA code

source: Verification failed. Please try again.
de: Verifizierung fehlgeschlagen. Bitte versuche es erneut.

source: Authentication failed
de: Authentifizierung fehlgeschlagen

source: Already have an account?
de: Hast du schon ein Benutzerkonto?

source: 42 OAuth Authentication
de: 42 OAuth Authentifizierung

source: Preparing authentication...
de: Bereite Authentifizierung vor...

source: Redirecting to 42's authentication service...
de: Weiterleitung zum 42 Authentifizierungs-service...

source: OAuth initialization failed
de: OAuth Initialisierung fehlgeschlagen

source: Failed to initialize OAuth:
de: Fehler bei Initialisierung von OAuth:

source: Back to Login
de: zurück zum Login

source: Completing Authentication
de: Fertigstellung der Authentifizierung

source: Verifying your authentication with 42...
de: Verifizieren der Authentifizierung mit 42...

source: Missing required OAuth parameters
de: Fehlende benötigte OAuth parameter

source: OAuth authentication failed
de: OAuth Authentifizierung fehlgeschlagen

source: Verification failed:
de: Verifizierung fehlgeschlagen:

source: Login successful! Redirecting to dashboard...
de: Login erfolgreich! Weiterleitung zur Benutzerübersicht

source: Join Today
de: Heute beitreten

source: Confirm Password:
de: Password bestätigen:

source: Sign Up
de: Anmelden

source: Username is required!
de: Benutzername is notwendig!

source: Email is required!
de: E-Mail ist notwendig!

source: Invalid email address!
de: Ungültige E-Mail Addresse!

source: Password is required!
de: Passwort ist notwendig!

source: Password confirmation is required!
de: Passwortwiederholung ist notwendig!

source: Passwords do not match!
de: Passwörter stimmen nicht überein!
